
# 指数代码列表配置
INDEX_SYMBOL_LIST = [
    '000016.XSHG', # 上证50
    '000001.XSHG', # 上证指数
    '399300.XSHE', # 沪深300
]

# 行业代码列表
INDUSTRY_INDEX_SYMBOL_LIST = [
    '801020.', # 采掘（申万一级）
    '801030.', # 化工
    '801040.', # 钢铁
    '801050.', # 有色金属
    '801710.', # 建筑材料
    '801720.', # 建筑装饰
    '801730.', # 电气设备
    '801890.', # 机械设备
    '801740.', # 国防军工
    '801880.', # 汽车
    '801110.', # 家用电器
    '801130.', # 纺织服装
    '801140.', # 轻工制造
    '801200.', # 商业贸易
    '801010.', # 农林牧渔
    '801120.', # 食品饮料
    '801210', # 休闲服务
    '801150', # 医药生物
    '801160', # 公用事业
    '801170', # 交通运输
    '801180', # 房地产
    '801080', # 电子
    '801750', # 计算机
    '801760', # 传媒
    '801770', # 通信
    '801780', # 银行
    '801790', # 非银金融
    '801230', # 综合
]

# 概念代码列表
CONCEPT_INDEX_SYMBOL_LIST = [
    'SC0329', # 英伟达概念
]